Revit 2024 API
BuiltInFailures.ElectricalFailures.PanelMismatchCircuitType Property
 Cannot assign [Element] to Circuit. The Type for the panel does not match the Type ([Name]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PanelMismatchCircuitType { get; }
Visual Basic
Public Shared ReadOnly Property PanelMismatchCircuitType As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PanelMismatchCircuitType {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace